In [1]:
import pandas as pd

In [3]:
#reading the restaurant csv file
restaurants = pd.read_csv("DOHMH_New_York_City_Restaurant_Inspection_Results.csv")

In [4]:
#print out first five rows
print(restaurants.head(5))

      CAMIS              DBA       BORO BUILDING            STREET  ZIPCODE  \
0  50005457     BIRCH COFFEE  Manhattan       62    MADISON AVENUE  10016.0
1  41696163  SHESHE PIZZERIA  Manhattan      961   COLUMBUS AVENUE  10025.0
2  50071467          TGA NYC  Manhattan      320  WEST   36 STREET  10018.0
3  50000500        STARBUCKS  Manhattan      625          8 AVENUE  10018.0
4  50089476     TACOS AZTECA      Bronx      537  EAST  184 STREET  10458.0

        PHONE CUISINE DESCRIPTION INSPECTION DATE  \
0  6096101637          Coffee/Tea      03/17/2017
1  2122227201               Pizza      04/19/2018
2  2126514842            American      09/20/2019
3  2122739613          Coffee/Tea      11/22/2019
4  3476456233             Tex-Mex      04/01/2019

                                            ACTION  ... RECORD DATE  \
0  Violations were cited in the following area(s).  ...  10/12/2021
1  Violations were cited in the following area(s).  ...  10/12/2021
2  Violations were cited in the following area(s).  ...  10/12/2021
3  Violations were cited in the following area(s).  ...  10/12/2021
4  Violations were cited in the following area(s).  ...  10/12/2021

                                     INSPECTION TYPE   Latitude  Longitude  \
0              Cycle Inspection / Initial Inspection  40.743479 -73.986088
1                   Cycle Inspection / Re-inspection  40.800049 -73.962259
2              Cycle Inspection / Initial Inspection  40.753817 -73.993362
3              Cycle Inspection / Initial Inspection  40.756185 -73.990565
4  Pre-permit (Non-operational) / Initial Inspection  40.855033 -73.891014

  Community Board Council District Census Tract        BIN           BBL   NTA
0           105.0              2.0       5600.0  1016887.0  1.008570e+09  MN13
1           107.0              7.0      19300.0  1055676.0  1.018430e+09  MN09
2           104.0              3.0      11100.0  1090332.0  1.007590e+09  MN13
3           104.0              3.0      11500.0  1083268.0  1.010320e+09  MN15
4           206.0             15.0      38500.0  2011605.0  2.030520e+09  BX01

[5 rows x 26 columns]

In [5]:
print(restaurants.shape)

(382752, 26)

In [6]:
# dropping duplicates from file 
restaurants=restaurants.drop_duplicates()

In [7]:
print(restaurants.shape)

(360184, 26)

In [8]:
#make all columns lower case
restaurants.columns=map(str.lower, restaurants.columns)

In [9]:
print(restaurants.columns)

Index(['camis', 'dba', 'boro', 'building', 'street', 'zipcode', 'phone',
       'cuisine description', 'inspection date', 'action', 'violation code',
       'violation description', 'critical flag', 'score', 'grade',
       'grade date', 'record date', 'inspection type', 'latitude', 'longitude',
       'community board', 'council district', 'census tract', 'bin', 'bbl',
       'nta'],
      dtype='object')

In [18]:
#rename columns names so they make more sense, don't forget axis=1
restaurants=restaurants.rename({'dba':'name', 'cuisine description':'cuisine'}, axis=1)

In [19]:
print(restaurants.dtypes)

camis                      int64
name                      object
boro                      object
building                  object
street                    object
zipcode                  float64
phone                     object
cuisine                   object
inspection date           object
action                    object
violation code            object
violation description     object
critical flag             object
score                    float64
grade                     object
grade date                object
record date               object
inspection type           object
latitude                 float64
longitude                float64
community board          float64
council district         float64
census tract             float64
bin                      float64
bbl                      float64
nta                       object
dtype: object

In [20]:
restaurants.nunique()

camis                    29648
name                     22880
boro                         6
building                  7694
street                    2466
zipcode                    229
phone                    27168
cuisine                     86
inspection date           1503
action                       5
violation code             106
violation description      106
critical flag                3
score                      136
grade                        7
grade date                1329
record date                  1
inspection type             31
latitude                 23501
longitude                23501
community board             69
council district            51
census tract              1188
bin                      20345
bbl                      19988
nta                        193
dtype: int64

In [21]:
# to look at missing values in each column
restaurants.isna().sum()

camis                         0
name                       1133
boro                          0
building                    789
street                       34
zipcode                    5335
phone                        25
cuisine                    4497
inspection date               0
action                     4496
violation code             9091
violation description      6718
critical flag                 0
score                     17725
grade                    181035
grade date               185204
record date                   0
inspection type            4496
latitude                    379
longitude                   379
community board            6377
council district           6377
census tract               6377
bin                        8058
bbl                        1076
nta                        6377
dtype: int64

In [22]:
#crosstab() computes the frequency of two or more variables. here we will look at na in cuisine based on boro
#returns boolean, all boros present and if the restaurant has cuisine listed
pd.crosstab(restaurants['boro'],restaurants['cuisine'].isna(), rownames=['boro'], colnames=['no cuisine listed'])

no cuisine listed   False  True
boro
0                     100     24
Bronx               33365    371
Brooklyn            89427   1234
Manhattan          139006   1689
Queens              82513    996
Staten Island       11276    183

In [23]:
#rules of tidy data exercise
#will execute melt function here
#first will create a messy dataset

data = pd.DataFrame({"Name":["Annie", "John", "Min-ji", "Ravi", "Lucas"],
                    "Test1": [85,92,88,86,91],
                    "Test2": [78,86,79,90,93],
                    "Test3": [98,90,95,78,88]})
print(data)

     Name  Test1  Test2  Test3
0   Annie     85     78     98
1    John     92     86     90
2  Min-ji     88     79     95
3    Ravi     86     90     78
4   Lucas     91     93     88

In [24]:
#now using melt to create a tidy dataset
data=pd.melt(data, id_vars=['Name'], var_name='Test', value_name='Score')
print(data)

      Name   Test  Score
0    Annie  Test1     85
1     John  Test1     92
2   Min-ji  Test1     88
3     Ravi  Test1     86
4    Lucas  Test1     91
5    Annie  Test2     78
6     John  Test2     86
7   Min-ji  Test2     79
8     Ravi  Test2     90
9    Lucas  Test2     93
10   Annie  Test3     98
11    John  Test3     90
12  Min-ji  Test3     95
13    Ravi  Test3     78
14   Lucas  Test3     88

In [25]:
#grouping by student to find their average score
data.groupby(by='Name').mean()

            Score
Name
Annie   87.000000
John    89.333333
Lucas   90.666667
Min-ji  87.333333
Ravi    84.666667

In [26]:
#or we can group by test score
data.groupby(by='Test').mean()

       Score
Test
Test1   88.4
Test2   85.2
Test3   89.8